In [5]:
import pandas as pd
import numpy as np
li = [1,2,3,4,5,6,7,8]
print(li)
liS = pd.Series(li)

[1, 2, 3, 4, 5, 6, 7, 8]

In [7]:
liS

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [15]:
liS.index = ['a','b','c','d','e','f','g','h']

print(liS)

a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
dtype: int64

In [14]:
se

a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
dtype: int64

In [16]:
myd = {

    'Name': ['ADitya Pratap','Aditya Singh','Aditya Prasad','Akansha Rawat','Prachi Rana'],
    'RollNo': [1,2,3,4,5]
}

In [17]:
dataF = pd.DataFrame(myd)

In [18]:
dataF

            Name  RollNo
0  ADitya Pratap       1
1   Aditya Singh       2
2  Aditya Prasad       3
3  Akansha Rawat       4
4    Prachi Rana       5

In [19]:
dataF.index = [1,2,3,4,5]

In [20]:
dataF.columns = ['Names','Rollno.']

In [21]:
dataF

           Names  Rollno.
1  ADitya Pratap        1
2   Aditya Singh        2
3  Aditya Prasad        3
4  Akansha Rawat        4
5    Prachi Rana        5

In [22]:
dataF.loc[2,'Names'] = 'Aditya Yadav'

In [23]:
dataF

           Names  Rollno.
1  ADitya Pratap        1
2   Aditya Yadav        2
3  Aditya Prasad        3
4  Akansha Rawat        4
5    Prachi Rana        5

In [ ]:
dataF.loc[4,:]